/*Задача номер 1. Расчёт подъёмной силы.
Условие:
Дан самолёт с крылом площадью S, скоростью полёта V, плотностью воздуха ro и коэффициентом CL
Требуется:
Написать программу на С++, которая вычисляет подъёмную силу по формуле: L=1/2*ro*V^2*S*CL, и выводит результат */

#include <iostream>
#include <cmath> //для вызова функции pow
#include <clocale> //для установки языкового стандарта всей программы: русский язык
#include <iomanip> //для точности вычислений

using namespace std;

int main() {

    setlocale(LC_CTYPE, "RUS");

    double S, V, ro, CL;

    //Вводим наши данные:
    cout << "Введите площадь крыла S: ";
    cin >> S;
    cout << "Введите скорость полета V: ";
    cin >> V;
    cout << "Введите плотность воздуха ro: ";
    cin >> ro;
    cout << "Введите коэффициент подъемной силы CL: ";
    cin >> CL;

    double L = 0.5 * ro * pow(V, 2) * S * CL;

    cout << "Подъемная сила L = " << fixed << setprecision(3) << L << " Н" << endl;

