/*Задача 3.
Условие:
Дан самолёт с массой m, подъёмной силой L, сопротивлением D и тягой двигателя T
Требуется:
Требуется:
Реализовать программу, которая ввычисляет ускорение по направлению движения по формуле: a=(T-D)/m и вертикальное ускорение: ay=(L-mg)/m*/

#include <iostream>
#include <cmath>
#include <iomanip>
#include <clocale>

using namespace std;

int main(){
    setlocale(LC_ALL, "Russian");
    double m, L, D, T;
    double const g = 9.81;
    cout << "Введите массу летательного аппарата m: ";
    cin >> m;
    cout << "Введите подъёмную силу летательного аппарата L: ";
    cin >> L;
    cout << "Введите силу сопротивления летательного аппарата D: ";
    cin >> D;
    cout << "Введите силу тяги двигателя летательного аппарата T: ";
    cin >> T;
    double a = (T - D) / m;
    double a_y = (L - m * g) / m;
    cout << "------------------------------------------------------------------"<<endl;
    cout << "|Ускорение по направлению движения, a|" << setw(10) << "Вертикальное ускорение, a_y|" << endl;
    cout << "------------------------------------------------------------------" << endl;
    cout << "|" << setw(20) << fixed << setprecision(2) << a << setw(17) << "|" << setw(17) << fixed << setprecision(2) << a_y << setw(11) << "|" << endl;
    cout << "------------------------------------------------------------------" << endl;
    return 0;
    
}

