/*Задача 6
Условие:
Самолёт движется с меняющейся скоростью вдоль траектрории
Есть массив скоростей V[i] и соответствующие значения плотности воздуха p[i] на разных высотах
Требуется:
Написать программу, которая вычисляет подъёмную силу на каждом шаге и выводит таблицу*/

#include <iostream>
#include <vector>
#include <iomanip>
#include <clocale>

using namespace std;

int main() {

    setlocale(LC_ALL, "RUS");

    vector<double> V = { 100, 150, 200, 250, 300 };
    vector<double> rho = { 1.225, 1.112, 1.007, 0.909, 0.819 };

    double S, CL;
    cout << "Введите площадь крыла S: ";
    cin >> S;
    cout << "Введите коэффициент подъемной силы CL: ";
    cin >> CL;

    cout << "\n| Шаг | Скорость | Плотность | Подъемная сила |" << endl;
    cout << "---------------------------------------------------" << endl;

    for (size_t i = 0; i < V.size(); i++) {
        double L = 0.5 * rho[i] * V[i] * V[i] * S * CL;
        cout << "| " << setw(3) << i + 1
            << " | " << setw(8) << V[i]
            << " | " << setw(9) << rho[i]
            << " | " << setw(14) << L << " |" << endl;
    }

    return 0;
}